*** Fitbit
 - task
   - org task -> add_alarm || update_alarm
   - delete task || manual -> delete_alarm
 - workout
   - org capture workout -> log_activity
   - fitbit workout -> clean -> (add detail) -> org workout
   - capture
     - tags: ['mobility', 'pull', 'push', 'legs', 'skill', 'hike']
     - data: ['workout-link']
   - fitbit
     - tags: ['run', 'yoga', 'weights', 'treadmill']
     - data: ['distance', 'workout-link', 'avg-mph', 'time']

 just need base http blocks and can rerun with different arguments as required      

 #+begin_src http :pretty
GET https://api.fitbit.com/1/user/-/activities/date/2017-01-01.json
Accept-Language: en_US
Authorization: Bearer eyJhbGciOiJIUzI1NiJ9.eyJzdWIiOiI0RDYyU1AiLCJhdWQiOiIyMjg3NFEiLCJpc3MiOiJGaXRiaXQiLCJ0eXAiOiJhY2Nlc3NfdG9rZW4iLCJzY29wZXMiOiJ3aHIgd251dCB3cHJvIHdzbGUgd3dlaSB3c29jIHdzZXQgd2FjdCB3bG9jIiwiZXhwIjoxNTE0ODc2ODkyLCJpYXQiOjE0ODMzNDA4OTJ9.MfyOC9u8RiHNQP5npfwp6GktfRMeQcUzBdoIs7ixjv0
 #+end_src      

 #+RESULTS:
 #+begin_example
{
  "summary": {
    "veryActiveMinutes": 95,
    "steps": 16361,
    "sedentaryMinutes": 1206,
    "restingHeartRate": 69,
    "marginalCalories": 1353,
    "lightlyActiveMinutes": 97,
    "heartRateZones": [
      {
        "name": "Out of Range",
        "minutes": 633,
        "min": 30,
        "max": 98,
        "caloriesOut": 1087.38792
      },
      {
        "name": "Fat Burn",
        "minutes": 159,
        "min": 98,
        "max": 137,
        "caloriesOut": 1098.87822
      },
      {
        "name": "Cardio",
        "minutes": 41,
        "min": 137,
        "max": 167,
        "caloriesOut": 546.26238
      },
      {
        "name": "Peak",
        "minutes": 3,
        "min": 167,
        "max": 220,
        "caloriesOut": 28.3878
      }
    ],
    "floors": 51,
    "fairlyActiveMinutes": 42,
    "elevation": 510,
    "distances": [
      {
        "distance": 9.27,
        "activity": "total"
      },
      {
        "distance": 9.27,
        "activity": "tracker"
      },
      {
        "distance": 0,
        "activity": "loggedActivities"
      },
      {
        "distance": 6.93,
        "activity": "veryActive"
      },
      {
        "distance": 0.9,
        "activity": "moderatelyActive"
      },
      {
        "distance": 1.31,
        "activity": "lightlyActive"
      },
      {
        "distance": 0.12,
        "activity": "sedentaryActive"
      }
    ],
    "caloriesOut": 3611,
    "caloriesBMR": 1946,
    "activityCalories": 1864,
    "activeScore": -1
  },
  "goals": {
    "steps": 10000,
    "floors": 10,
    "distance": 5,
    "caloriesOut": 3132,
    "activeMinutes": 30
  },
  "activities": []
}
 #+end_example

* Current
#+NAME: tab-exercises-updat
#+begin_src emacs-lisp :var exercises=tab-exercises :colnames no :hlines yes
(cl-defun health--read (HEADER OPTIONS &optional (FORMAT-FUNC #'-list))
  """HEADER prompts resulting list of strings from FORMAT-FUNC applied to OPTIONS"""
  (if (or (not OPTIONS) (eq "" OPTIONS))
      (read-string (concat HEADER ": "))
    (helm :sources (helm-build-sync-source HEADER
                     :candidates (lambda () (funcall FORMAT-FUNC OPTIONS))
                     :fuzzy-match t))))

(defun health--table-headers (TABLE) (nth 0 TABLE))
(defun health--table-options (TABLE) (nth 1 TABLE))
(defun health--table-values (TABLE) (-slice TABLE (+ 1 (-elem-index 'hline TABLE))))
(defun health--table-options-format () (-partial #'s-split "/"))

(defun health--prompt-add (TABLE)
  """Prompts a row for TABLE"""
  ;; (--zip-with (health--read it (s-split "/" other))
  (--zip-with (health--read it other (health--table-options-format))
              (health--table-headers TABLE)
              (health--table-options TABLE)))

(defun health--add-to-table (TABLE)
  """Prompts and appends row to TABLE"""
  (append TABLE (list (health--prompt-add TABLE)))) ; can be replaced with :results append

(defun health--prompt-table ()
  """Collects and prompts a table name"""
  (health--read "Table"
                (org-element-map (org-element-parse-buffer 'element) 'table
                  (-partial #'org-element-property :name))))

(defun health--narrow-table (TABLE)
  """Filters TABLE on prompted column"""
  (let* ((headers (health--table-headers TABLE))
         (column (-elem-index
                  (health--read "Filter" headers) headers))
         (options (-distinct
                   (-select-column column
                                   (health--table-values TABLE)))))
    (health--read "By value" options)))

(defun health--get-table ()
  (save-excursion
    (let* ((tables (org-element-map (org-element-parse-buffer 'element) 'table
                     (lambda (table)
                       (let ((name (org-element-property :name table)))
                         (when name
                           (-list ':name name
                                  ':contents-begin (org-element-property :contents-begin table)))))))
           (selection (health--read
                       "Table" (--map (plist-get it ':name) tables)))
           (table (--first (string= selection (plist-get it ':name))
                          tables))
           (pos (plist-get table :contents-begin)))
      (goto-char pos)
      (org-table-to-lisp))))

; (health--add-to-table exercises)
; (health--collect-tables)
; (health--prompt-table)
; (health--narrow-table exercises)
(health--get-table)
#+end_src

#+RESULTS: tab-exercises-updat
| Name    | Type                | Timed  | Weighted |
|         | push/pull/legs/core | yes/no | yes/no   |
|---------+---------------------+--------+----------|
| pullups | pull                | yes    | yes      |
| pushups | push                | no     | yes      |
| scaps   | pull                | no     | no       |

* Table Ops
# #+begin_src emacs-lisp :var (health--select-table)
#+NAME: a
#+begin_src emacs-lisp :prologue (health--select-table)
; (org-table-to-lisp)
table
#+end_src

#+RESULTS: a
| Name    | Type                | Timed  | Weighted |
|         | push/pull/legs/core | yes/no | yes/no   |
| pullups | pull                | yes    | yes      |
| pushups | push                | no     | yes      |
| scaps   | pull                | no     | no       |
